using System;
/*Задание 3 
Создайте приложение, которое может быть запущено только в одном экземпляре (используя 
именованный Mutex). */
namespace pro_12_3
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
